# 创建一个空集合
s = set()
s = {1,2,1,124,43,456,6,5,234,2341,231,21,2,1}
print(s)  # {1, 2, 5, 6, 2341, 456, 231, 234, 43, 21, 124}
# 字典是无序的,值是唯一的,它会自动排序

# 添加操作
# add(item) 可以是数字,字符串,随意添加,自动排序,按Unicode排序
s1 = {1,2,3,4,5,6,7,2,3,3}
s1.add(8)
s1.add("8")
print(s1)  # {1, 2, 3, 4, 5, 6, 7, 8, '8'}
# update(set)添加集合(内容相同的元素无法添加进去)
s2 = {6,5,234,2341,231,21,2,1}
s2.update((1,2,1,124,43,456,6,5,234,2341))
print(s2)  # {1, 2, 2341, 5, 6, 231, 456, 234, 43, 21, 124}

# 删除集合
# clear()
s = set(range(1,10))
s.clear()
print(s)  # set()
# del
# s = set(range(1,10))
# del s
# print(s)  # NameError: name 's' is not defined
